use kursovayadb;

insert privilege()
values
(1, 'діти, один із батьків яких загинув або зник безвісти в районі проведення АТО'),
(2, 'діти осіб, які загинули під час Революції Гідності'),
(3, 'діти учасників бойових дій на території інших держав (загиблих, які зникли безвісти)'),
(4, 'особи, у яких один із батьків був військовослужбовцем і загинув (зник безвісти)'),
(5, 'особи, у яких один із батьків був поліцейським і загинув (пропав безвісти)'),
(6, 'особи з інвалідністю I, II груп та діти з інвалідністю віком до 18 років'),
(7, 'особи з інвалідністю з-поміж учасників ліквідації аварії на ЧАЕС та потерпілі від Чорнобильської катастрофи'),
(8, 'Діти, чиї батьки мають підземний стаж не менше 15 років або загинули на виробництві або стали інвалідами І, ІІ групи'),
(9, 'діти осіб, визнаних постраждалими учасниками Революції Гідності, учасниками бойових дій'),
(10, 'переселенці'),
(11, 'діти з багатодітних сімей (5 та більше)');

insert country()
values
(1, 'Україна'),
(2, 'Росія'),
(3, 'Білорусь');

insert city()
values
(1, 'Вінниця', 1),
(2, 'Кропивницький', 1),
(3, 'Полтава', 1),
(4, 'Харків', 1),
(5, 'Дніпро', 1),
(6, 'Луганськ', 1),
(7, 'Рівне', 1),
(8, 'Херсон', 1),
(9, 'Донецьк', 1),
(10, 'Луцьк', 1),
(11, 'Сімферополь', 1),
(12, 'Хмельницький', 1),
(13, 'Житомир', 1),
(14, 'Львів', 1),
(15, 'Суми', 1),
(16, 'Черкаси', 1),
(17, 'Запоріжжя', 1),
(18, 'Миколаїв', 1),
(19, 'Тернопіль', 1),
(20, 'Вінниця', 1),
(21, 'Чернігів', 1),
(22, 'Івано-Франківськ', 1),
(23, 'Одеса', 1),
(24, 'Ужгород', 1),
(25, 'Чернівці', 1),
(26, 'Київ', 1),
(27, 'Москва', 2),
(28, 'Санкт-Петербург', 2),
(29, 'Мінськ', 3),
(30, 'Брест', 3);

insert subjects()
values
(1, 'Українська мова і література'),
(2, 'Українська мова'),
(3, 'Англійська мова'),
(4, 'Фізика'),
(5, 'Біологія'),
(6, 'Хімія'),
(7, 'Історія України'),
(8, 'Географія'),
(9, 'Іспанська мова'),
(10, 'Німецька мова'),
(11, 'Французька мова'),
(12, 'Математика'),
(13, 'Математика (рівень стандарту)');

insert form_of_education()
values
(1, 'Денна'),
(2, 'Заочна');

insert form_of_payment_for_education()
values
(1, 'Бюджет'),
(2, 'Контракт'),
(3, 'Бюджет/Контракт');

insert EQL()
values
(1, 'Бакалавр'),
(2, 'Магістр');


insert faculty()
values
(1, 'Факультет iнформатики та обчислювальної технiки', 'ФІОТ'),
(2, 'Факультет прикладної математики', 'ФПМ'),
(3, 'Інститут прикладного системного аналізу', 'ІПСА'),
(4, 'Фiзико-технiчний iнститут', 'ФТІ');

insert speciality()
values
(121, 'Інженерія програмного забезпечення', 1, 172.5),
(121, 'Інженерія програмного забезпечення', 2, 162.3),
(122, 'Комп’ютерні науки та інформаційні технології', 3, 168.8),
(123, 'Комп’ютерна інженерія', 1, 170.3),
(123, 'Комп’ютерна інженерія', 2, 160.3),
(124, 'Системний аналіз', 3, 165.7),
(125, 'Кібербезпека', 4, 169.9),
(126, 'Інформаційні системи та технології', 1, 165.8),
(113, 'Прикладна математика', 2, 163.4),
(113, 'Прикладна математика', 4, 163.4);

alter table abiturient
modify Ab_Privilege int;

insert abiturient
values
 (30, 'Кассандра', 'Семенівна', 'Качинська', "2000-08-13", 312332, 9999, "380(97)197-76-87", '981c@gmail.com', 27 , 'пл. Леніна, 81', 'ЗОШ І-ІІІ ст. №235', '2020-05-31', null),
(31, 'Дарина', 'Іванівна', 'Давиденко', "2000-03-28",  333333, 8888,  "380(97)024-87-45", '9darina@ukr.net', 28, 'пл. Перемоги, 43', 'Ліцей №293', '2020-05-31',  null);


insert abiturient()
values
(1, 'Кассандра', 'Семенівна', 'Качинська', "2000-08-03", 307988, 4294, "380(97)197-70-86", 'b1c@gmail.com', 26 , 'пл. Володимирська, 81', 'ЗОШ І-ІІІ ст. №27', '2020-05-31', null),
(2, 'Дарина', 'Адріанівна', 'Яніцька', "2000-03-31",  101763, 4569,  "380(97)024-85-45", '8darina@ukr.net', 26, 'пл. Хрещатик, 43', 'Ліцей №293', '2020-05-31',  null),
(3, 'Ася', 'Устимівна', 'Кияшко', "2001-07-08",  713515,  4078,  "380(97)132-23-73", 'htsz9@gmail.com',  2, 'пров. Фізкультури, 10', 'Школа-ліцей №1', '2020-05-31',  null),
(4, 'Борислав', 'Ігорович', 'Лоський', "2001-01-26",  353326,  4142,  "380(97)239-32-69", 'a65pa@gmail.com', 26, 'пров. Б. Грінченка, 85', 'Cлавутицька ЗОШ №1', '2020-05-31',  1),
(5, 'Красимира', 'Пилипівна', 'Березенко', "2000-04-05",  303290,  4355, "380(97)239-32-59", 'kra5ro@ukr.net', 13, 'пл. Арсенальна, 98', 'ЗОШ І-ІІІ ст. №2', '2020-05-31',  null),
(6, 'Євгеній', 'Радимович', 'Бутницький', "2000-09-19",  485208,  4289,  "380(97)731-38-69", 'dz@ukr.net', 1, 'вул. Шота Руставелі, 73', 'Ліцей №2', '2020-05-31',  2),
(7, 'Юзефа', 'Найденівна', 'Марусик', "2000-08-16",  544719,  4937,  "380(97)013-49-63", 'zc64@gmail.com', 14, 'пров. Хрещатик, 40', 'ЗОШ І-ІІІ ст. №4', '2020-05-31',  3),
(8, 'Драгомир', 'Богуславович', 'Індик', "2002-07-04",  859007,  4878,  "380(97)126-26-23", 'e2cx@ukr.net', 25, 'пл. Різницька, 27', 'Ліцей №3', '2020-05-31',  null),
(9, 'Валентина', 'Леонідівна', 'Яворовська', "2002-12-05",  519210,  4866,  "380(97)622-88-11", 'euft@gmail.com', 26, 'вул. Тараса Шевченка, 24', 'ЗОШ І-ІІІ ст. №3', '2020-05-31', null ),
(10, 'Нестор', 'Орестович', 'Шелепницький', "2001-12-21",  188799,  4077 ,  "380(97)530-30-93", 'zthirnjuv@gmail.com', 11, 'вул. Солом’янська, 16', 'Ліцей №2', '2020-05-31',  3),
(11, 'Тіна', 'Захарівна', 'Демиденко', "2004-04-02",  906548,  4226 ,  "380(63)976-00-13", 'ac21r@ukr.net', 17, 'просп. Б. Грінченка, 74', 'ЗОШ І-ІІІ ст. №21', '2020-05-31', null),
(12, 'Михайло', 'Герасимович', 'Саранчук', "2004-11-11",  399835,  4024 ,  "380(93)299-41-76", 's80ibdhl@gmail.com', 26, 'вул. І. Франкa, 53', 'Ліцей №56', '2020-05-31', null),
(13, 'Капитоліна', 'Яромирівна', 'Кривко', "2000-06-27",  362790,  4128 ,  "380(93)641-30-33", 'to@gmail.com', 8, 'вул. Солом’янська, 23', 'ЗОШ І-ІІІ ст. №24', '2020-05-31', null ),
(14, 'Олександр', 'Омелянович', 'Романюк', "2000-06-30",  690233,  4028 ,  "380(68)526-91-50", 'u9r4cv@ukr.net', 6, 'пл. І. Франкa, 32', 'ЗОШ І-ІІІ ст. №14', '2020-05-31', 5),
(15, 'Шарлота', 'Давидівна', 'Алськевич', "2002-08-10",  570439,  4649 ,  "380(68)589-39-74", 'p86f@ukr.net', 7, 'вул. Солом’янська, 23', 'ЗОШ І-ІІІ ст. №7', '2020-05-31', 11); 

insert abiturient()
values
(16, 'Олексій', 'Ігорович', 'Хохлов', "2001-01-26",  310384,  4134,  "380(97)239-32-70", 'a3pa@gmail.com', 25, 'пл. І. Франкa, 32', 'Cлавутицька ЗОШ №1', '2020-05-31',  2),
(17, 'Тарас', 'Герасимович', 'Адамович', "2003-11-16",  581314,  4956 , "380(67)096-19-77", '01xy8zi2@gmail.com', 26, 'пл. Паторжинського, 28', 'ЗОШ І-ІІІ ст. №11', '2020-05-31', null),
(18, 'Наталія', 'Леонідівна', 'Матвієнко', "2004-06-27",  757897,  4158 ,  "380(67)374-97-33", '9lbqkzyr5@ukr.net',  25, 'пл. Інститутська, 27', 'ЗОШ І-ІІІ ст. №5', '2020-05-31', null),
(19, 'Дорофій', 'Максимович', 'Веремієнко', "2003-10-27",  166246,  4825 ,  "380(67)940-23-27", 's2a0y@ukr.net',  27, 'пров. Пирогова, 81', 'Ліцей №4', '2020-05-31',  10),
(20, 'Анна', 'Давидівна', 'Дацюк', "2004-03-04",  561551,  4262 ,  "380(68)134-58-85", 'cp20@ukr.net',  1, 'просп. Володимирська, 25', 'ЗОШ І-ІІІ ст. №7', '2020-05-31', null),
(21, 'Орест', 'Левович', 'Добряк', "2001-05-02",  791845,  4033 ,  "380(68)878-84-88", 'pnw6uv3k@ukr.net',  26, 'вул. Солом’янська, 37', 'Школа-ліцей №2', '2020-05-31', 5 ),
(22, 'Олеся', 'Леонідівна', 'Головань', "2000-01-17",  556624,  4590 , "380(63)509-48-22" , '9im4bs@gmail.com',  3, 'просп. Михайла Грушевського, 29', 'ЗОШ І-ІІІ ст. №14', '2020-05-31', 6),
(23, 'Євгеній', 'Устимович', 'Дацко', "2000-09-20", 362209 ,  4032 ,  "380(63)948-89-46", '0ne@gmail.com',  4, 'пров. Фізкультури, 39', 'ЗОШ І-ІІІ №21', '2020-05-31',  10),
(24, 'Владислава', 'Владиславівна', 'Федецька', "2001-09-30",  278471,  4254 ,  "380(67)449-31-72", 'xvlb26@gmail.com', 13 , 'вул. Арсенальна, 21', 'ЗОШ І-ІІІ ст. №14', '2020-05-31', 9 ),
(25, 'Олександр', 'Вікторович', 'Бродович', "2004-11-20",  543974,  4194 , "380(67)030-87-47" , 'kbin@ukr.net',  26, 'вул. П. Орлика, 32', 'Ліцей №4', '2020-05-31', null ),
(26, 'Тарас', 'Максимович', 'Воронько', "2002-07-30",  492729,  4749 , "380(67)955-28-39" , 'sz@gmail.com',  17, 'вул. М. Коцюбинського, 11', 'Ліцей №56', '2020-05-31', 10 ),
(27, 'Наталія', 'Ростиславівна', 'Белецька', "2003-05-07",  135882,  4281 , "380(67)241-73-44" , 'sl@ukr.net',  26, 'вул. Хрещатик, 10', 'ЗОШ І-ІІІ №21', '2020-05-31', null),
(28, 'Артем', 'Тарасович', 'Бучко', "2000-03-10",  738890,  4430 , "380(63)577-91-23" , 'hnr0a@gmail.com',  1, 'вул. П. Орлика, 32', 'Ліцей №4', '2020-05-31', null);




select * from abiturient;
select * from application;
select * from certificate_zno;
select * from city;
select * from country;
select * from eql;
select * from faculty;
select * from form_of_education;
select * from form_of_payment_for_education;
select * from privilege;
select * from speciality;
select * from subjects;